## Import Libraries

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# Import file
KPMG=pd.read_excel('KPMG1.xlsx')

In [ ]:
from pandas import ExcelWriter
from pandas import ExcelFile

In [ ]:
transactions = pd.read_excel('KPMG1.xlsx', sheet_name='Transactions')
new_customer_lists = pd.read_excel('KPMG1.xlsx', sheet_name='NewCustomerList')
customer_demographic = pd.read_excel('KPMG1.xlsx', sheet_name='CustomerDemographic')
customer_add = pd.read_excel('KPMG1.xlsx', sheet_name='CustomerAddress')

## Exploring the Transactions Dataset

In [ ]:
# print first 5 rows
transactions.head()

   transaction_id  product_id  ...  standard_cost product_first_sold_date
0               1           2  ...          53.62                 41245.0
1               2           3  ...         388.92                 41701.0
2               3          37  ...         248.82                 36361.0
3               4          88  ...         381.10                 36145.0
4               5          78  ...         709.48                 42226.0

[5 rows x 13 columns]

In [ ]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [ ]:
#convert date columns from integer to datetime
transactions['transaction_date'] = pd.to_datetime(transactions['transaction_date'], unit='s')
transactions['transaction_date'].head()

0   2017-02-25
1   2017-05-21
2   2017-10-16
3   2017-08-31
4   2017-10-01
Name: transaction_date, dtype: datetime64[ns]

In [ ]:
#convert date columns from integer to datetime
transactions['product_first_sold_date'] = pd.to_datetime(transactions['product_first_sold_date'], unit='s')
transactions['product_first_sold_date'].head()

0   1970-01-01 11:27:25
1   1970-01-01 11:35:01
2   1970-01-01 10:06:01
3   1970-01-01 10:02:25
4   1970-01-01 11:43:46
Name: product_first_sold_date, dtype: datetime64[ns]

In [ ]:
transactions.describe()

       transaction_id   product_id  ...    list_price  standard_cost
count    20000.000000  20000.00000  ...  20000.000000   19803.000000
mean     10000.500000     45.36465  ...   1107.829449     556.046951
std       5773.647028     30.75359  ...    582.825242     405.955660
min          1.000000      0.00000  ...     12.010000       7.210000
25%       5000.750000     18.00000  ...    575.270000     215.140000
50%      10000.500000     44.00000  ...   1163.890000     507.580000
75%      15000.250000     72.00000  ...   1635.300000     795.100000
max      20000.000000    100.00000  ...   2091.470000    1759.850000

[8 rows x 6 columns]

In [ ]:
transactions.shape

(20000, 13)

## Exploring Missing Values

In [ ]:
transactions.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

## Identifying Duplicate Values

In [ ]:
dups = transactions.duplicated()
transactions[dups].sum()

transaction_id             0.0
product_id                 0.0
customer_id                0.0
transaction_date           0.0
online_order               0.0
order_status               0.0
brand                      0.0
product_line               0.0
product_class              0.0
product_size               0.0
list_price                 0.0
standard_cost              0.0
product_first_sold_date    0.0
dtype: float64

## Exploring Columns

In [ ]:
transactions.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [ ]:
transactions['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [ ]:
transactions['order_status'].unique()

array(['Approved', 'Cancelled'], dtype=object)

In [ ]:
transactions['order_status'].nunique()

2

In [ ]:
transactions['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [ ]:
transactions['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [ ]:
transactions['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

In [ ]:
transactions['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

## Exploring New Customer List Dataset

In [ ]:
new_customer_lists.head()

  first_name  last_name  gender  ...  Unnamed: 20 Rank     Value
0    Chickie    Brister    Male  ...            1    1  1.718750
1      Morly     Genery    Male  ...            1    1  1.718750
2    Ardelis  Forrester  Female  ...            1    1  1.718750
3     Lucine      Stutt  Female  ...            4    4  1.703125
4    Melinda     Hadlee  Female  ...            4    4  1.703125

[5 rows x 23 columns]

In [ ]:
new_customer_lists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [ ]:
# Drop Unnamed Column
cols = ['Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20']
new_customer_lists = new_customer_lists.drop(cols, axis=1)

In [ ]:
# Check for null values
new_customer_lists.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [ ]:
# Checking for duplicate values
new_customer_lists.duplicated().sum()

0

## Explore Columns

In [ ]:
new_customer_lists['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [ ]:
new_customer_lists['gender'].str.replace('U','Unspecified')

0        Male
1        Male
2      Female
3      Female
4      Female
        ...
995      Male
996      Male
997    Female
998      Male
999      Male
Name: gender, Length: 1000, dtype: object

In [ ]:
new_customer_lists['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [ ]:
new_customer_lists['DOB'].describe()

count                     983
unique                    958
top       1961-07-31 00:00:00
freq                        2
first     1938-06-08 00:00:00
last      2002-02-27 00:00:00
Name: DOB, dtype: object

## Exploring Customer Demographic

In [ ]:
customer_demographic.head()

   customer_id      first_name  ... owns_car tenure
0            1         Laraine  ...      Yes   11.0
1            2             Eli  ...      Yes   16.0
2            3           Arlin  ...      Yes   15.0
3            4          Talbot  ...       No    7.0
4            5  Sheila-kathryn  ...      Yes    8.0

[5 rows x 13 columns]

In [ ]:
customer_demographic['default'].value_counts()

100                                       113
1                                         112
-1                                        111
-100                                       99
â°â´âµâââ                                  53
                                         ...
ç¤¾æç§å­¸é¢èªå­¸ç ç©¶æ                     31
/dev/null; touch /tmp/blns.fail ; echo     30
âªâªtestâª                                 29
ì¸ëë°í ë¥´                                 27
,ãã»:*:ã»ãâ( â» Ï â» )ãã»:*:ã»ãâ           25
Name: default, Length: 90, dtype: int64

In [ ]:
customer_demographic = customer_demographic.drop('default', axis=1)

In [ ]:
customer_demographic.head()

   customer_id      first_name  last_name  ... deceased_indicator  owns_car tenure
0            1         Laraine  Medendorp  ...                  N       Yes   11.0
1            2             Eli    Bockman  ...                  N       Yes   16.0
2            3           Arlin     Dearle  ...                  N       Yes   15.0
3            4          Talbot        NaN  ...                  N        No    7.0
4            5  Sheila-kathryn     Calton  ...                  N       Yes    8.0

[5 rows x 12 columns]

In [ ]:
customer_demographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  owns_car                             4000 non-null   object
 11  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(8)
memory usage: 375.1+ KB

In [ ]:

customer_demographic['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
M            1
Femal        1
Name: gender, dtype: int64

In [ ]:
# Replace inconsistent values with appropriate values
customer_demographic['gender'] = customer_demographic['gender'].replace('F','Female').replace('M','Male').replace('Femal','Female').replace('U','Unspecified')

In [ ]:
customer_demographic['gender'].unique()

array(['Female', 'Male', 'Unspecified'], dtype=object)

## Merge all customer information from three tables into one table

In [ ]:
new_customer_lists.head()

  first_name  last_name  gender  ...  property_valuation Rank     Value
0    Chickie    Brister    Male  ...                   6    1  1.718750
1      Morly     Genery    Male  ...                  11    1  1.718750
2    Ardelis  Forrester  Female  ...                   5    1  1.718750
3     Lucine      Stutt  Female  ...                   1    4  1.703125
4    Melinda     Hadlee  Female  ...                   9    4  1.703125

[5 rows x 18 columns]

In [ ]:
customer_demographic['customer_id'].iloc[-1]

4000

In [ ]:
new_customer_lists.insert(0, 'customer_id', range(4001, 4001 + len(new_customer_lists)))

In [ ]:
new_customer_lists.head()

   customer_id first_name  last_name  ... property_valuation  Rank     Value
0         4001    Chickie    Brister  ...                  6     1  1.718750
1         4002      Morly     Genery  ...                 11     1  1.718750
2         4003    Ardelis  Forrester  ...                  5     1  1.718750
3         4004     Lucine      Stutt  ...                  1     4  1.703125
4         4005    Melinda     Hadlee  ...                  9     4  1.703125

[5 rows x 19 columns]

In [ ]:
customer_demographic.head()

   customer_id      first_name  last_name  ... deceased_indicator  owns_car tenure
0            1         Laraine  Medendorp  ...                  N       Yes   11.0
1            2             Eli    Bockman  ...                  N       Yes   16.0
2            3           Arlin     Dearle  ...                  N       Yes   15.0
3            4          Talbot        NaN  ...                  N        No    7.0
4            5  Sheila-kathryn     Calton  ...                  N       Yes    8.0

[5 rows x 12 columns]

In [ ]:
customer_add.head()

   customer_id              address  ...    country property_valuation
0            1   060 Morning Avenue  ...  Australia                 10
1            2  6 Meadow Vale Court  ...  Australia                 10
2            4   0 Holy Cross Court  ...  Australia                  9
3            5  17979 Del Mar Point  ...  Australia                  4
4            6     9 Oakridge Court  ...  Australia                  9

[5 rows x 6 columns]

In [ ]:
customer_add.shape

(3999, 6)

In [ ]:
# Merge dataframes using the customer_id column
customer_demographic = pd.merge(customer_demographic, customer_add, how='left', on='customer_id')

In [ ]:
customer_demographic.head()

   customer_id      first_name  ...    country property_valuation
0            1         Laraine  ...  Australia               10.0
1            2             Eli  ...  Australia               10.0
2            3           Arlin  ...        NaN                NaN
3            4          Talbot  ...  Australia                9.0
4            5  Sheila-kathryn  ...  Australia                4.0

[5 rows x 17 columns]

In [ ]:
customer_demographic.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [ ]:
customer_demographic = customer_demographic.drop(['address','postcode','state','country','property_valuation'], axis=1)

In [ ]:
customer_demographic.head()

   customer_id      first_name  last_name  ... deceased_indicator  owns_car tenure
0            1         Laraine  Medendorp  ...                  N       Yes   11.0
1            2             Eli    Bockman  ...                  N       Yes   16.0
2            3           Arlin     Dearle  ...                  N       Yes   15.0
3            4          Talbot        NaN  ...                  N        No    7.0
4            5  Sheila-kathryn     Calton  ...                  N       Yes    8.0

[5 rows x 12 columns]

In [ ]:
customer_demographic.shape

(4000, 12)

In [ ]:
customer_demographic.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure'],
      dtype='object')

In [ ]:
new_df = pd.concat([customer_demographic, new_customer_lists], ignore_index=True, sort=False)

In [ ]:
new_df.head()

   customer_id      first_name  last_name  ... property_valuation  Rank Value
0            1         Laraine  Medendorp  ...                NaN   NaN   NaN
1            2             Eli    Bockman  ...                NaN   NaN   NaN
2            3           Arlin     Dearle  ...                NaN   NaN   NaN
3            4          Talbot        NaN  ...                NaN   NaN   NaN
4            5  Sheila-kathryn     Calton  ...                NaN   NaN   NaN

[5 rows x 19 columns]

In [ ]:
customer_demographic = new_df

In [ ]:
customer_demographic.shape

(5000, 19)